In [1]:
import pandas as pd
from datetime import date, timedelta
from sqlalchemy import create_engine

engine = create_engine('sqlite:///c:\\ruby\\portlt\\db\\development.sqlite3')
conlt = engine.connect()
engine = create_engine('sqlite:///c:\\ruby\\portmy\\db\\development.sqlite3')
conmy = engine.connect()
engine = create_engine(
    "postgresql+psycopg2://postgres:admin@localhost:5432/portpg_development"
)
conpg = engine.connect()

year = 2023
quarter = 2
today = date.today()
today_str = today.strftime('%Y-%m-%d')
today_str

'2023-05-17'

In [5]:
today = date(2023, 5, 1)
today_str = today.strftime("%Y-%m-%d")
today_str

'2023-05-01'

In [3]:
format_dict = {'q_amt':'{:,}','y_amt':'{:,}','yoy_gain':'{:,}',
               'q_amt_c':'{:,}','q_amt_p':'{:,}',
               'aq_amt':'{:,}','ay_amt':'{:,}','acc_gain':'{:,}',
               'latest_amt':'{:,}','previous_amt':'{:,}','inc_amt':'{:,}',
               'latest_amt_q':'{:,}','previous_amt_q':'{:,}','inc_amt_q':'{:,}',
               'latest_amt_y':'{:,}','previous_amt_y':'{:,}','inc_amt_y':'{:,}',
               'inc_pct':'{:.2f}','inc_pct_q':'{:.2f}','inc_pct_y':'{:.2f}'}

### Process for specified stocks

In [4]:
names = ('AP','BANPU')
sql = """
SELECT name,year,quarter,q_amt,y_amt,aq_amt,ay_amt 
FROM epss 
WHERE year = %s AND quarter = %s
AND name IN %s
"""
sql = sql % (year, quarter, names)
epss = pd.read_sql(sql, conlt)
epss.style.format(format_dict)

### End of Process for specified stocks

In [7]:
sql = """
SELECT name,year,quarter,q_amt,y_amt,aq_amt,ay_amt 
FROM epss 
WHERE year = %s AND quarter = %s
AND publish_date >= '%s'"""
sql = sql % (year, quarter, today_str)
epss = pd.read_sql(sql, conlt)
epss.head().style.format(format_dict)

### End of Normal Process

In [8]:
strqtr = "Q" + str(quarter)
strqtr

'Q2'

In [9]:
sql = '''
SELECT name, year, quarter, latest_amt, previous_amt, inc_amt, inc_pct 
FROM qt_profits 
WHERE year = %s AND quarter = "Q%s"
'''
sql = sql % (year, quarter)
qt_pf = pd.read_sql(sql, conlt)
qt_pf.sort_values(['inc_pct'],ascending=[False]).shape[0]

6

In [10]:
df_merge = pd.merge(epss, qt_pf, on=['name'], suffixes=(['_e','_q']), how='inner')
df_merge.head().sort_values(['inc_pct'],ascending=[False]).style.format(format_dict)

### Delete duplicated year and quarter

In [11]:
columns = ['year_q','quarter_q']
epssqt_pf = df_merge.drop(columns, axis='columns')
epssqt_pf.head().style.format(format_dict)

In [12]:
sql = '''
SELECT name, year, quarter, latest_amt, previous_amt, inc_amt, inc_pct 
FROM yr_profits 
WHERE year = %s AND quarter = "Q%s"'''
sql = sql % (year, quarter)
yr_pf = pd.read_sql(sql, conlt)
yr_pf.head().sort_values(['inc_pct'],ascending=[False]).style.format(format_dict)

In [13]:
df_merge2 = pd.merge(epssqt_pf, yr_pf, on=['name'], suffixes=(['_q','_y']), how='inner')
df_merge2.head().style.format(format_dict)

### Delete duplicated year and quarter

In [14]:
columns = ['year_e','quarter_e']
profits = df_merge2.drop(columns, axis='columns')
profits.head().style.format(format_dict)

### Filter criteria
1. Current yearly profit amount > 440 millions
2. Previous yearly profit amount > 400 millions
3. Yearly gain percent >= 10 percent

In [15]:
profits[profits['name'] == 'OISHI'].style.format(format_dict)

In [16]:
criteria_1 = profits.latest_amt_y > 440000
cols = 'name latest_amt_y previous_amt_y inc_amt_y inc_pct_y'.split()
profits.loc[criteria_1,cols].sort_values(['latest_amt_y'],ascending=[False]).style.format(format_dict)

In [17]:
criteria_2 = profits.previous_amt_y > 400000
profits.loc[criteria_2,cols].sort_values(['previous_amt_y'],ascending=[False]).style.format(format_dict)

In [18]:
criteria_3 = profits.inc_pct_y > 10
profits.loc[criteria_3,cols].sort_values(['inc_pct_y'],ascending=[False]).style.format(format_dict)

In [19]:
criteria_4 = (profits.q_amt > profits.y_amt)
colt = 'name q_amt y_amt inc_amt_q inc_pct_q'.split()
profits.loc[criteria_4,colt].sort_values(['inc_pct_q'],ascending=[False]).style.format(format_dict)

In [20]:
# NO CRITERIA-2
profits_criteria = criteria_1 & criteria_2 & criteria_3 & criteria_4
#profits_criteria = criteria_1 & criteria_3 & criteria_4

filter = profits.loc[profits_criteria]
filter.sort_values(['inc_pct_y'],ascending=[False]).style.format(format_dict)

In [21]:
columns = 'year quarter q_amt y_amt aq_amt ay_amt'.split()
pre_final = filter.drop(columns, axis=1)
pre_final.sort_values(['name'],ascending=[True]).style.format(format_dict)

In [22]:
final = pre_final.loc[:,:]
final.style.format(format_dict)

In [23]:
final.sort_values(['name'], ascending=True).style.format(format_dict)

In [24]:
sql = '''
SELECT A.name,A.year,A.quarter,A.q_amt AS q_amt_c,A.y_amt,B.q_amt AS q_amt_p 
FROM epss A JOIN epss B ON a.name = B.name 
WHERE A.year = %s AND A.quarter = %s 
AND B.year = %s AND B.quarter = (%s-1)'''
sql = sql % (year, quarter, year, quarter)
print(sql)

SELECT A.name,A.year,A.quarter,A.q_amt AS q_amt_c,A.y_amt,B.q_amt AS q_amt_p
FROM epss A JOIN epss B ON a.name = B.name
WHERE A.year = 2023 AND A.quarter = 2
AND B.year = 2023 AND B.quarter = (2-1)

In [25]:
epss2 = pd.read_sql(sql, conlt)
epss2.shape[0]

6

In [26]:
df_merge3 = pd.merge(final, epss2, on=['name'], suffixes=(['_f','_e']), how='inner')
df_merge3.style.format(format_dict)

### The fifth criteria, added on 2022q1

In [27]:
mask = (df_merge3.q_amt_c > df_merge3.q_amt_p)
df_merge3 = df_merge3[mask]
df_merge3

,name,latest_amt_q,previous_amt_q,inc_amt_q,inc_pct_q,latest_amt_y,previous_amt_y,inc_amt_y,inc_pct_y,year,quarter,q_amt_c,y_amt,q_amt_p
0,FPT,2033577,2029252,4325,0.21,2033577,1684084,349493,20.75,2023,2,316979,312654,314905
1,OISHI,1187041,1126122,60919,5.41,1187041,834166,352875,42.30,2023,2,325685,264766,316960
2,TFFIF,1996055,1921578,74477,3.88,1996055,1209444,786611,65.04,2023,2,472071,397594,472036

In [28]:
final2 = df_merge3[['name','year','quarter',\
'latest_amt_y','previous_amt_y','inc_amt_y','inc_pct_y',\
'latest_amt_q','previous_amt_q','inc_amt_q','inc_pct_q',\
'q_amt_c', 'y_amt', 'q_amt_p']]               
final2.style.format(format_dict)

In [29]:
def better(vals):
    current, previous = vals
    if current > previous:
        return 1
    else:
        return 0

In [30]:
final2['kind'] = final2[['q_amt_c', 'q_amt_p']].apply(better, axis=1)

C:\Users\User\AppData\Local\Temp/ipykernel_42580/170999467.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final2['kind'] = final2[['q_amt_c', 'q_amt_p']].apply(better, axis=1)

In [31]:
final2.kind.value_counts()

1    3
Name: kind, dtype: int64

In [32]:
final2['inc_amt_py'] = (final2['q_amt_c']-final2['y_amt'])
final2['inc_pct_py'] = (final2['inc_amt_py']/abs(final2['y_amt'])*100)

final2['inc_amt_pq'] = (final2['q_amt_c']-final2['q_amt_p'])
final2['inc_pct_pq'] = (final2['inc_amt_pq']/abs(final2['q_amt_p'])*100)

C:\Users\User\AppData\Local\Temp/ipykernel_42580/553347636.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final2['inc_amt_py'] = (final2['q_amt_c']-final2['y_amt'])
C:\Users\User\AppData\Local\Temp/ipykernel_42580/553347636.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final2['inc_pct_py'] = (final2['inc_amt_py']/abs(final2['y_amt'])*100)
C:\Users\User\AppData\Local\Temp/ipykernel_42580/553347636.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final2['inc_amt_pq'] = (final2['q_amt_c']-final2['q_amt_p'])
C:\Users\User\AppData\Local\Temp/ipykernel_42580/553347636.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final2['inc_pct_pq'] = (final2['inc_amt_pq']/abs(final2['q_amt_p'])*100)

In [33]:
import numpy as np
final2['inc_pct_py'].replace('inf', np.nan, inplace=True)

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\generic.py:6619: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return self._update_inplace(result)

In [34]:
final2['mean_pct'] = final2[['inc_pct_y','inc_pct_q','inc_pct_py','inc_pct_pq']].mean(axis=1, skipna=True)

C:\Users\User\AppData\Local\Temp/ipykernel_42580/462442401.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final2['mean_pct'] = final2[['inc_pct_y','inc_pct_q','inc_pct_py','inc_pct_pq']].mean(axis=1, skipna=True)

In [35]:
final2[['name','mean_pct']].sort_values(['mean_pct'], ascending=False)

    name   mean_pct
2  TFFIF  21.914834
1  OISHI  18.367833
0    FPT   5.750482

In [36]:
final2['std_pct'] = final2[['inc_pct_y','inc_pct_q','inc_pct_py','inc_pct_pq']].std(axis=1)

C:\Users\User\AppData\Local\Temp/ipykernel_42580/714542820.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final2['std_pct'] = final2[['inc_pct_y','inc_pct_q','inc_pct_py','inc_pct_pq']].std(axis=1)

In [37]:
final2[['name','std_pct']].sort_values(['std_pct'], ascending=True)

    name    std_pct
0    FPT  10.011356
1  OISHI  18.312317
2  TFFIF  29.861353

In [38]:
sql = 'SELECT name, id FROM tickers'
tickers = pd.read_sql(sql, conlt)

df_merge4 = pd.merge(final2, tickers, on='name', how='inner')
df_merge4.rename(columns={"id":"ticker_id"}, inplace = True)

final3 = df_merge4[['name','year','quarter','kind',\
                    'latest_amt_y','previous_amt_y','inc_amt_y','inc_pct_y',\
                    'latest_amt_q','previous_amt_q','inc_amt_q','inc_pct_q',\
                    'q_amt_c','y_amt','inc_amt_py','inc_pct_py',\
                    'q_amt_p','inc_amt_pq','inc_pct_pq','ticker_id','mean_pct','std_pct']]

rcds = final3.values.tolist()
rcds

[['FPT',
  2023,
  2,
  1,
  2033577,
  1684084,
  349493,
  20.75,
  2033577,
  2029252,
  4325,
  0.21,
  316979,
  312654,
  4325,
  1.3833183007413947,
  314905,
  2074,
  0.6586113272256712,
  746,
  5.750482406991766,
  10.011355997882749],
 ['OISHI',
  2023,
  2,
  1,
  1187041,
  834166,
  352875,
  42.3,
  1187041,
  1126122,
  60919,
  5.41,
  325685,
  264766,
  60919,
  23.008618931433794,
  316960,
  8725,
  2.75271327612317,
  338,
  18.36783305188924,
  18.312317452324987],
 ['TFFIF',
  2023,
  2,
  1,
  1996055,
  1209444,
  786611,
  65.04,
  1996055,
  1921578,
  74477,
  3.88,
  472071,
  397594,
  74477,
  18.731922513921237,
  472036,
  35,
  0.007414688710183122,
  686,
  21.914834300657855,
  29.86135253882515]]

In [39]:
final3.sort_values(['name'],ascending=[True])

,name,year,quarter,kind,latest_amt_y,previous_amt_y,inc_amt_y,inc_pct_y,latest_amt_q,previous_amt_q,...,q_amt_c,y_amt,inc_amt_py,inc_pct_py,q_amt_p,inc_amt_pq,inc_pct_pq,ticker_id,mean_pct,std_pct
0,FPT,2023,2,1,2033577,1684084,349493,20.75,2033577,2029252,...,316979,312654,4325,1.383318,314905,2074,0.658611,746,5.750482,10.011356
1,OISHI,2023,2,1,1187041,834166,352875,42.30,1187041,1126122,...,325685,264766,60919,23.008619,316960,8725,2.752713,338,18.367833,18.312317
2,TFFIF,2023,2,1,1996055,1209444,786611,65.04,1996055,1921578,...,472071,397594,74477,18.731923,472036,35,0.007415,686,21.914834,29.861353

In [40]:
sr = final3['name']
names = sr.values.tolist()
names

['FPT', 'OISHI', 'TFFIF']

In [41]:
names = sr.values.tolist()
in_p = ", ".join(map(lambda name: "'%s'" % name, names))
in_p

"'FPT', 'OISHI', 'TFFIF'"

In [42]:
sql = """
DELETE FROM profits
WHERE name IN (%s)
AND year = %s AND quarter = %s
"""
sql = sql % (in_p, year, quarter)
print(sql)

DELETE FROM profits
WHERE name IN ('FPT', 'OISHI', 'TFFIF')
AND year = 2023 AND quarter = 2

In [43]:
rp = conlt.execute(sql)
rp.rowcount

0

In [44]:
for rcd in rcds:
    print(rcd)

['FPT', 2023, 2, 1, 2033577, 1684084, 349493, 20.75, 2033577, 2029252, 4325, 0.21, 316979, 312654, 4325, 1.3833183007413947, 314905, 2074, 0.6586113272256712, 746, 5.750482406991766, 10.011355997882749]
['OISHI', 2023, 2, 1, 1187041, 834166, 352875, 42.3, 1187041, 1126122, 60919, 5.41, 325685, 264766, 60919, 23.008618931433794, 316960, 8725, 2.75271327612317, 338, 18.36783305188924, 18.312317452324987]
['TFFIF', 2023, 2, 1, 1996055, 1209444, 786611, 65.04, 1996055, 1921578, 74477, 3.88, 472071, 397594, 74477, 18.731922513921237, 472036, 35, 0.007414688710183122, 686, 21.914834300657855, 29.86135253882515]

In [45]:
sql = """
INSERT INTO profits (name, year, quarter, kind,
latest_amt_y, previous_amt_y, inc_amt_y, inc_pct_y,
latest_amt_q, previous_amt_q, inc_amt_q, inc_pct_q,
q_amt_c, y_amt, inc_amt_py, inc_pct_py,
q_amt_p, inc_amt_pq, inc_pct_pq,
ticker_id, mean_pct, std_pct)
VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
"""
print(sql)

INSERT INTO profits (name, year, quarter, kind,
latest_amt_y, previous_amt_y, inc_amt_y, inc_pct_y,
latest_amt_q, previous_amt_q, inc_amt_q, inc_pct_q,
q_amt_c, y_amt, inc_amt_py, inc_pct_py,
q_amt_p, inc_amt_pq, inc_pct_pq,
ticker_id, mean_pct, std_pct)
VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

In [46]:
for rcd in rcds:
    conlt.execute(sql, rcd)

### End of Create Data

### Insert Profits from PortLt to PortMy

In [47]:
print(final3.name)

0      FPT
1    OISHI
2    TFFIF
Name: name, dtype: object

In [48]:
sr = final3['name']
names = sr.values.tolist()
names

['FPT', 'OISHI', 'TFFIF']

In [49]:
in_p = ', '.join(map(lambda name: "'%s'" % name, names))
in_p

"'FPT', 'OISHI', 'TFFIF'"

In [50]:
sql = """
DELETE FROM profits
WHERE name IN (%s)
AND year = %s AND quarter = %s
"""
sql = sql % (in_p, year, quarter)
print(sql)

DELETE FROM profits
WHERE name IN ('FPT', 'OISHI', 'TFFIF')
AND year = 2023 AND quarter = 2

In [51]:
rp = conmy.execute(sql)
rp.rowcount

0

In [52]:
sql = """
SELECT * 
FROM profits 
WHERE name IN (%s) AND year = %s AND quarter = %s"""
sql = sql % (in_p, year, quarter)
print(sql)

SELECT *
FROM profits
WHERE name IN ('FPT', 'OISHI', 'TFFIF') AND year = 2023 AND quarter = 2

In [53]:
profits_inp = pd.read_sql(sql, conlt)
profits_inp.sort_values(by=['kind','name'],ascending=[True,True])

,id,name,year,quarter,kind,latest_amt_y,previous_amt_y,inc_amt_y,inc_pct_y,latest_amt_q,...,q_amt_c,y_amt,inc_amt_py,inc_pct_py,q_amt_p,inc_amt_pq,inc_pct_pq,ticker_id,mean_pct,std_pct
0,2597,FPT,2023,2,1,2033577,1684084,349493,20.75,2033577,...,316979,312654,4325,1.383318,314905,2074,0.658611,746,5.750482,10.011356
1,2598,OISHI,2023,2,1,1187041,834166,352875,42.30,1187041,...,325685,264766,60919,23.008619,316960,8725,2.752713,338,18.367833,18.312317
2,2599,TFFIF,2023,2,1,1996055,1209444,786611,65.04,1996055,...,472071,397594,74477,18.731923,472036,35,0.007415,686,21.914834,29.861353

In [54]:
rcds = profits_inp.values.tolist()
len(rcds)

3

In [55]:
for rcd in rcds:
    print(rcd)

[2597, 'FPT', 2023, 2, 1, 2033577, 1684084, 349493, 20.75, 2033577, 2029252, 4325, 0.21, 316979, 312654, 4325, 1.3833183007413947, 314905, 2074, 0.6586113272256712, 746, 5.750482406991766, 10.011355997882749]
[2598, 'OISHI', 2023, 2, 1, 1187041, 834166, 352875, 42.3, 1187041, 1126122, 60919, 5.41, 325685, 264766, 60919, 23.008618931433794, 316960, 8725, 2.75271327612317, 338, 18.36783305188924, 18.312317452324987]
[2599, 'TFFIF', 2023, 2, 1, 1996055, 1209444, 786611, 65.04, 1996055, 1921578, 74477, 3.88, 472071, 397594, 74477, 18.731922513921237, 472036, 35, 0.007414688710183122, 686, 21.914834300657855, 29.86135253882515]

In [56]:
sql = """
INSERT INTO profits (id, name, year, quarter, kind,
latest_amt_y, previous_amt_y, inc_amt_y, inc_pct_y,
latest_amt_q, previous_amt_q, inc_amt_q, inc_pct_q,
q_amt_c, y_amt, inc_amt_py, inc_pct_py,
q_amt_p, inc_amt_pq, inc_pct_pq,
ticker_id, mean_pct, std_pct)
VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
"""
print(sql)

INSERT INTO profits (id, name, year, quarter, kind,
latest_amt_y, previous_amt_y, inc_amt_y, inc_pct_y,
latest_amt_q, previous_amt_q, inc_amt_q, inc_pct_q,
q_amt_c, y_amt, inc_amt_py, inc_pct_py,
q_amt_p, inc_amt_pq, inc_pct_pq,
ticker_id, mean_pct, std_pct)
VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

In [57]:
for rcd in rcds:
    conmy.execute(sql, rcd)

In [58]:
sql = '''
SELECT name, year, quarter 
FROM profits
ORDER BY name
'''
df_tmp = pd.read_sql(sql, conmy)
df_tmp.set_index('name', inplace=True)
df_tmp.index

Index(['AH', 'AMATA', 'AWC', 'BBL', 'BDMS', 'BEM', 'BH', 'EA', 'FPT', 'GULF',
       'HANA', 'ICHI', 'ILM', 'KKP', 'KTB', 'KTC', 'LANNA', 'LHFG', 'OISHI',
       'PTG', 'PTTEP', 'SIRI', 'TASCO', 'TFFIF', 'TTB'],
      dtype='object', name='name')

### After call 250-Export-to-PortPg

In [59]:
sql = """
SELECT * 
FROM profits 
WHERE name IN (%s) AND year = %s AND quarter = %s"""
sql = sql % (in_p, year, quarter)
print(sql)

SELECT *
FROM profits
WHERE name IN ('FPT', 'OISHI', 'TFFIF') AND year = 2023 AND quarter = 2

In [60]:
profits_inp = pd.read_sql(sql, conpg)
profits_inp[['name','ticker_id']].sort_values(by=[ "name"], ascending=[True])

    name  ticker_id
2    FPT        722
1  OISHI        346
0  TFFIF        655

In [61]:
sql = """
SELECT * 
FROM profits 
WHERE year = %s AND quarter = %s"""
sql = sql % (year, quarter)
tmp = pd.read_sql(sql, conmy)
tmp.shape

(3, 23)

In [62]:
sql = """
SELECT * 
FROM tickers
WHERE name IN (%s)
ORDER BY name"""
sql = sql % in_p
print(sql)

SELECT *
FROM tickers
WHERE name IN ('FPT', 'OISHI', 'TFFIF')
ORDER BY name

In [63]:
tickers = pd.read_sql(sql, conpg)
tickers[['name','id','market']].sort_values(by=[ "name"], ascending=[True])

    name   id market
0    FPT  722    SET
1  OISHI  346    SET
2  TFFIF  655    SET